/* automatically generated by rust-bindgen 0.72.1 */

pub const MI_MALLOC_VERSION: u32 = 316;
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const MI_SMALL_WSIZE_MAX: u32 = 128;
pub type wchar_t = ::core::ffi::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::core::ffi::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::core::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::core::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
unsafe extern "C" {
    pub fn mi_malloc(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_calloc(count: usize, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_realloc(p: *mut ::core::ffi::c_void, newsize: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_expand(p: *mut ::core::ffi::c_void, newsize: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_free(p: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn mi_strdup(s: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn mi_strndup(s: *const ::core::ffi::c_char, n: usize) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn mi_realpath(
        fname: *const ::core::ffi::c_char,
        resolved_name: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn mi_malloc_small(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_zalloc_small(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_zalloc(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_mallocn(count: usize, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_reallocn(
        p: *mut ::core::ffi::c_void,
        count: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_reallocf(p: *mut ::core::ffi::c_void, newsize: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_usable_size(p: *const ::core::ffi::c_void) -> usize;
}
unsafe extern "C" {
    pub fn mi_good_size(size: usize) -> usize;
}
pub type mi_deferred_free_fun = ::core::option::Option<
    unsafe extern "C" fn(
        force: bool,
        heartbeat: ::core::ffi::c_ulonglong,
        arg: *mut ::core::ffi::c_void,
    ),
>;
unsafe extern "C" {
    pub fn mi_register_deferred_free(
        deferred_free: mi_deferred_free_fun,
        arg: *mut ::core::ffi::c_void,
    );
}
pub type mi_output_fun = ::core::option::Option<
    unsafe extern "C" fn(msg: *const ::core::ffi::c_char, arg: *mut ::core::ffi::c_void),
>;
unsafe extern "C" {
    pub fn mi_register_output(out: mi_output_fun, arg: *mut ::core::ffi::c_void);
}
pub type mi_error_fun = ::core::option::Option<
    unsafe extern "C" fn(err: ::core::ffi::c_int, arg: *mut ::core::ffi::c_void),
>;
unsafe extern "C" {
    pub fn mi_register_error(fun: mi_error_fun, arg: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn mi_collect(force: bool);
}
unsafe extern "C" {
    pub fn mi_version() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_stats_reset();
}
unsafe extern "C" {
    pub fn mi_stats_merge();
}
unsafe extern "C" {
    pub fn mi_stats_print(out: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn mi_stats_print_out(out: mi_output_fun, arg: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn mi_thread_stats_print_out(out: mi_output_fun, arg: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn mi_options_print();
}
unsafe extern "C" {
    pub fn mi_process_info(
        elapsed_msecs: *mut usize,
        user_msecs: *mut usize,
        system_msecs: *mut usize,
        current_rss: *mut usize,
        peak_rss: *mut usize,
        current_commit: *mut usize,
        peak_commit: *mut usize,
        page_faults: *mut usize,
    );
}
unsafe extern "C" {
    pub fn mi_process_init();
}
unsafe extern "C" {
    pub fn mi_process_done();
}
unsafe extern "C" {
    pub fn mi_thread_init();
}
unsafe extern "C" {
    pub fn mi_thread_done();
}
unsafe extern "C" {
    pub fn mi_malloc_aligned(size: usize, alignment: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_malloc_aligned_at(
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_zalloc_aligned(size: usize, alignment: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_zalloc_aligned_at(
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_calloc_aligned(
        count: usize,
        size: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_calloc_aligned_at(
        count: usize,
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_realloc_aligned(
        p: *mut ::core::ffi::c_void,
        newsize: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_realloc_aligned_at(
        p: *mut ::core::ffi::c_void,
        newsize: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mi_heap_s {
    _unused: [u8; 0],
}
pub type mi_heap_t = mi_heap_s;
unsafe extern "C" {
    pub fn mi_heap_new() -> *mut mi_heap_t;
}
unsafe extern "C" {
    pub fn mi_heap_delete(heap: *mut mi_heap_t);
}
unsafe extern "C" {
    pub fn mi_heap_destroy(heap: *mut mi_heap_t);
}
unsafe extern "C" {
    pub fn mi_heap_set_default(heap: *mut mi_heap_t) -> *mut mi_heap_t;
}
unsafe extern "C" {
    pub fn mi_heap_get_default() -> *mut mi_heap_t;
}
unsafe extern "C" {
    pub fn mi_heap_get_backing() -> *mut mi_heap_t;
}
unsafe extern "C" {
    pub fn mi_heap_collect(heap: *mut mi_heap_t, force: bool);
}
unsafe extern "C" {
    pub fn mi_heap_malloc(heap: *mut mi_heap_t, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_zalloc(heap: *mut mi_heap_t, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_calloc(
        heap: *mut mi_heap_t,
        count: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_mallocn(
        heap: *mut mi_heap_t,
        count: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_malloc_small(heap: *mut mi_heap_t, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_realloc(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newsize: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_reallocn(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        count: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_reallocf(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newsize: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_strdup(
        heap: *mut mi_heap_t,
        s: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn mi_heap_strndup(
        heap: *mut mi_heap_t,
        s: *const ::core::ffi::c_char,
        n: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn mi_heap_realpath(
        heap: *mut mi_heap_t,
        fname: *const ::core::ffi::c_char,
        resolved_name: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn mi_heap_malloc_aligned(
        heap: *mut mi_heap_t,
        size: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_malloc_aligned_at(
        heap: *mut mi_heap_t,
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_zalloc_aligned(
        heap: *mut mi_heap_t,
        size: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_zalloc_aligned_at(
        heap: *mut mi_heap_t,
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_calloc_aligned(
        heap: *mut mi_heap_t,
        count: usize,
        size: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_calloc_aligned_at(
        heap: *mut mi_heap_t,
        count: usize,
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_realloc_aligned(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newsize: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_realloc_aligned_at(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newsize: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_rezalloc(p: *mut ::core::ffi::c_void, newsize: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_recalloc(
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_rezalloc_aligned(
        p: *mut ::core::ffi::c_void,
        newsize: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_rezalloc_aligned_at(
        p: *mut ::core::ffi::c_void,
        newsize: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_recalloc_aligned(
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_recalloc_aligned_at(
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_rezalloc(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newsize: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_recalloc(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_rezalloc_aligned(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newsize: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_rezalloc_aligned_at(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newsize: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_recalloc_aligned(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_recalloc_aligned_at(
        heap: *mut mi_heap_t,
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_contains_block(heap: *mut mi_heap_t, p: *const ::core::ffi::c_void) -> bool;
}
unsafe extern "C" {
    pub fn mi_heap_check_owned(heap: *mut mi_heap_t, p: *const ::core::ffi::c_void) -> bool;
}
unsafe extern "C" {
    pub fn mi_check_owned(p: *const ::core::ffi::c_void) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mi_heap_area_s {
    pub blocks: *mut ::core::ffi::c_void,
    pub reserved: usize,
    pub committed: usize,
    pub used: usize,
    pub block_size: usize,
    pub full_block_size: usize,
    pub heap_tag: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mi_heap_area_s"][::core::mem::size_of::<mi_heap_area_s>() - 56usize];
    ["Alignment of mi_heap_area_s"][::core::mem::align_of::<mi_heap_area_s>() - 8usize];
    ["Offset of field: mi_heap_area_s::blocks"]
        [::core::mem::offset_of!(mi_heap_area_s, blocks) - 0usize];
    ["Offset of field: mi_heap_area_s::reserved"]
        [::core::mem::offset_of!(mi_heap_area_s, reserved) - 8usize];
    ["Offset of field: mi_heap_area_s::committed"]
        [::core::mem::offset_of!(mi_heap_area_s, committed) - 16usize];
    ["Offset of field: mi_heap_area_s::used"]
        [::core::mem::offset_of!(mi_heap_area_s, used) - 24usize];
    ["Offset of field: mi_heap_area_s::block_size"]
        [::core::mem::offset_of!(mi_heap_area_s, block_size) - 32usize];
    ["Offset of field: mi_heap_area_s::full_block_size"]
        [::core::mem::offset_of!(mi_heap_area_s, full_block_size) - 40usize];
    ["Offset of field: mi_heap_area_s::heap_tag"]
        [::core::mem::offset_of!(mi_heap_area_s, heap_tag) - 48usize];
};
pub type mi_heap_area_t = mi_heap_area_s;
pub type mi_block_visit_fun = ::core::option::Option<
    unsafe extern "C" fn(
        heap: *const mi_heap_t,
        area: *const mi_heap_area_t,
        block: *mut ::core::ffi::c_void,
        block_size: usize,
        arg: *mut ::core::ffi::c_void,
    ) -> bool,
>;
unsafe extern "C" {
    pub fn mi_heap_visit_blocks(
        heap: *const mi_heap_t,
        visit_blocks: bool,
        visitor: mi_block_visit_fun,
        arg: *mut ::core::ffi::c_void,
    ) -> bool;
}
unsafe extern "C" {
    pub fn mi_is_in_heap_region(p: *const ::core::ffi::c_void) -> bool;
}
unsafe extern "C" {
    pub fn mi_is_redirected() -> bool;
}
unsafe extern "C" {
    pub fn mi_reserve_huge_os_pages_interleave(
        pages: usize,
        numa_nodes: usize,
        timeout_msecs: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_reserve_huge_os_pages_at(
        pages: usize,
        numa_node: ::core::ffi::c_int,
        timeout_msecs: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_reserve_os_memory(size: usize, commit: bool, allow_large: bool)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_manage_os_memory(
        start: *mut ::core::ffi::c_void,
        size: usize,
        is_committed: bool,
        is_pinned: bool,
        is_zero: bool,
        numa_node: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    pub fn mi_debug_show_arenas();
}
unsafe extern "C" {
    pub fn mi_arenas_print();
}
unsafe extern "C" {
    pub fn mi_arena_min_alignment() -> usize;
}
pub type mi_arena_id_t = *mut ::core::ffi::c_void;
unsafe extern "C" {
    pub fn mi_arena_area(arena_id: mi_arena_id_t, size: *mut usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_reserve_huge_os_pages_at_ex(
        pages: usize,
        numa_node: ::core::ffi::c_int,
        timeout_msecs: usize,
        exclusive: bool,
        arena_id: *mut mi_arena_id_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_reserve_os_memory_ex(
        size: usize,
        commit: bool,
        allow_large: bool,
        exclusive: bool,
        arena_id: *mut mi_arena_id_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_manage_os_memory_ex(
        start: *mut ::core::ffi::c_void,
        size: usize,
        is_committed: bool,
        is_pinned: bool,
        is_zero: bool,
        numa_node: ::core::ffi::c_int,
        exclusive: bool,
        arena_id: *mut mi_arena_id_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn mi_heap_new_in_arena(arena_id: mi_arena_id_t) -> *mut mi_heap_t;
}
pub type mi_subproc_id_t = *mut ::core::ffi::c_void;
unsafe extern "C" {
    pub fn mi_subproc_main() -> mi_subproc_id_t;
}
unsafe extern "C" {
    pub fn mi_subproc_new() -> mi_subproc_id_t;
}
unsafe extern "C" {
    pub fn mi_subproc_delete(subproc: mi_subproc_id_t);
}
unsafe extern "C" {
    pub fn mi_subproc_add_current_thread(subproc: mi_subproc_id_t);
}
unsafe extern "C" {
    pub fn mi_abandoned_visit_blocks(
        subproc_id: mi_subproc_id_t,
        heap_tag: ::core::ffi::c_int,
        visit_blocks: bool,
        visitor: mi_block_visit_fun,
        arg: *mut ::core::ffi::c_void,
    ) -> bool;
}
unsafe extern "C" {
    pub fn mi_heap_set_numa_affinity(heap: *mut mi_heap_t, numa_node: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn mi_heap_guarded_set_sample_rate(heap: *mut mi_heap_t, sample_rate: usize, seed: usize);
}
unsafe extern "C" {
    pub fn mi_heap_guarded_set_size_bound(heap: *mut mi_heap_t, min: usize, max: usize);
}
unsafe extern "C" {
    pub fn mi_thread_set_in_threadpool();
}
unsafe extern "C" {
    pub fn mi_heap_new_ex(
        heap_tag: ::core::ffi::c_int,
        allow_destroy: bool,
        arena_id: mi_arena_id_t,
    ) -> *mut mi_heap_t;
}
unsafe extern "C" {
    pub fn mi_reserve_huge_os_pages(
        pages: usize,
        max_secs: f64,
        pages_reserved: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_collect_reduce(target_thread_owned: usize);
}
pub type mi_commit_fun_t = ::core::option::Option<
    unsafe extern "C" fn(
        commit: bool,
        start: *mut ::core::ffi::c_void,
        size: usize,
        is_zero: *mut bool,
        user_arg: *mut ::core::ffi::c_void,
    ) -> bool,
>;
unsafe extern "C" {
    pub fn mi_manage_memory(
        start: *mut ::core::ffi::c_void,
        size: usize,
        is_committed: bool,
        is_pinned: bool,
        is_zero: bool,
        numa_node: ::core::ffi::c_int,
        exclusive: bool,
        commit_fun: mi_commit_fun_t,
        commit_fun_arg: *mut ::core::ffi::c_void,
        arena_id: *mut mi_arena_id_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn mi_arena_unload(
        arena_id: mi_arena_id_t,
        base: *mut *mut ::core::ffi::c_void,
        accessed_size: *mut usize,
        size: *mut usize,
    ) -> bool;
}
unsafe extern "C" {
    pub fn mi_arena_reload(
        start: *mut ::core::ffi::c_void,
        size: usize,
        commit_fun: mi_commit_fun_t,
        commit_fun_arg: *mut ::core::ffi::c_void,
        arena_id: *mut mi_arena_id_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn mi_heap_reload(heap: *mut mi_heap_t, arena: mi_arena_id_t) -> bool;
}
unsafe extern "C" {
    pub fn mi_heap_unload(heap: *mut mi_heap_t);
}
unsafe extern "C" {
    pub fn mi_arena_contains(arena_id: mi_arena_id_t, p: *const ::core::ffi::c_void) -> bool;
}
pub const mi_option_e_mi_option_show_errors: mi_option_e = 0;
pub const mi_option_e_mi_option_show_stats: mi_option_e = 1;
pub const mi_option_e_mi_option_verbose: mi_option_e = 2;
pub const mi_option_e_mi_option_eager_commit: mi_option_e = 3;
pub const mi_option_e_mi_option_arena_eager_commit: mi_option_e = 4;
pub const mi_option_e_mi_option_purge_decommits: mi_option_e = 5;
pub const mi_option_e_mi_option_allow_large_os_pages: mi_option_e = 6;
pub const mi_option_e_mi_option_reserve_huge_os_pages: mi_option_e = 7;
pub const mi_option_e_mi_option_reserve_huge_os_pages_at: mi_option_e = 8;
pub const mi_option_e_mi_option_reserve_os_memory: mi_option_e = 9;
pub const mi_option_e_mi_option_deprecated_segment_cache: mi_option_e = 10;
pub const mi_option_e_mi_option_deprecated_page_reset: mi_option_e = 11;
pub const mi_option_e_mi_option_abandoned_page_purge: mi_option_e = 12;
pub const mi_option_e_mi_option_deprecated_segment_reset: mi_option_e = 13;
pub const mi_option_e_mi_option_eager_commit_delay: mi_option_e = 14;
pub const mi_option_e_mi_option_purge_delay: mi_option_e = 15;
pub const mi_option_e_mi_option_use_numa_nodes: mi_option_e = 16;
pub const mi_option_e_mi_option_disallow_os_alloc: mi_option_e = 17;
pub const mi_option_e_mi_option_os_tag: mi_option_e = 18;
pub const mi_option_e_mi_option_max_errors: mi_option_e = 19;
pub const mi_option_e_mi_option_max_warnings: mi_option_e = 20;
pub const mi_option_e_mi_option_deprecated_max_segment_reclaim: mi_option_e = 21;
pub const mi_option_e_mi_option_destroy_on_exit: mi_option_e = 22;
pub const mi_option_e_mi_option_arena_reserve: mi_option_e = 23;
pub const mi_option_e_mi_option_arena_purge_mult: mi_option_e = 24;
pub const mi_option_e_mi_option_deprecated_purge_extend_delay: mi_option_e = 25;
pub const mi_option_e_mi_option_disallow_arena_alloc: mi_option_e = 26;
pub const mi_option_e_mi_option_retry_on_oom: mi_option_e = 27;
pub const mi_option_e_mi_option_visit_abandoned: mi_option_e = 28;
pub const mi_option_e_mi_option_guarded_min: mi_option_e = 29;
pub const mi_option_e_mi_option_guarded_max: mi_option_e = 30;
pub const mi_option_e_mi_option_guarded_precise: mi_option_e = 31;
pub const mi_option_e_mi_option_guarded_sample_rate: mi_option_e = 32;
pub const mi_option_e_mi_option_guarded_sample_seed: mi_option_e = 33;
pub const mi_option_e_mi_option_generic_collect: mi_option_e = 34;
pub const mi_option_e_mi_option_page_reclaim_on_free: mi_option_e = 35;
pub const mi_option_e_mi_option_page_full_retain: mi_option_e = 36;
pub const mi_option_e_mi_option_page_max_candidates: mi_option_e = 37;
pub const mi_option_e_mi_option_max_vabits: mi_option_e = 38;
pub const mi_option_e_mi_option_pagemap_commit: mi_option_e = 39;
pub const mi_option_e_mi_option_page_commit_on_demand: mi_option_e = 40;
pub const mi_option_e_mi_option_page_max_reclaim: mi_option_e = 41;
pub const mi_option_e_mi_option_page_cross_thread_max_reclaim: mi_option_e = 42;
pub const mi_option_e__mi_option_last: mi_option_e = 43;
pub const mi_option_e_mi_option_large_os_pages: mi_option_e = 6;
pub const mi_option_e_mi_option_eager_region_commit: mi_option_e = 4;
pub const mi_option_e_mi_option_reset_decommits: mi_option_e = 5;
pub const mi_option_e_mi_option_reset_delay: mi_option_e = 15;
pub const mi_option_e_mi_option_abandoned_page_reset: mi_option_e = 12;
pub const mi_option_e_mi_option_limit_os_alloc: mi_option_e = 17;
pub type mi_option_e = ::core::ffi::c_uint;
pub use self::mi_option_e as mi_option_t;
unsafe extern "C" {
    pub fn mi_option_is_enabled(option: mi_option_t) -> bool;
}
unsafe extern "C" {
    pub fn mi_option_enable(option: mi_option_t);
}
unsafe extern "C" {
    pub fn mi_option_disable(option: mi_option_t);
}
unsafe extern "C" {
    pub fn mi_option_set_enabled(option: mi_option_t, enable: bool);
}
unsafe extern "C" {
    pub fn mi_option_set_enabled_default(option: mi_option_t, enable: bool);
}
unsafe extern "C" {
    pub fn mi_option_get(option: mi_option_t) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn mi_option_get_clamp(
        option: mi_option_t,
        min: ::core::ffi::c_long,
        max: ::core::ffi::c_long,
    ) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn mi_option_get_size(option: mi_option_t) -> usize;
}
unsafe extern "C" {
    pub fn mi_option_set(option: mi_option_t, value: ::core::ffi::c_long);
}
unsafe extern "C" {
    pub fn mi_option_set_default(option: mi_option_t, value: ::core::ffi::c_long);
}
unsafe extern "C" {
    pub fn mi_cfree(p: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn mi__expand(p: *mut ::core::ffi::c_void, newsize: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_malloc_size(p: *const ::core::ffi::c_void) -> usize;
}
unsafe extern "C" {
    pub fn mi_malloc_good_size(size: usize) -> usize;
}
unsafe extern "C" {
    pub fn mi_malloc_usable_size(p: *const ::core::ffi::c_void) -> usize;
}
unsafe extern "C" {
    pub fn mi_posix_memalign(
        p: *mut *mut ::core::ffi::c_void,
        alignment: usize,
        size: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_memalign(alignment: usize, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_valloc(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_pvalloc(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_aligned_alloc(alignment: usize, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_reallocarray(
        p: *mut ::core::ffi::c_void,
        count: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_reallocarr(
        p: *mut ::core::ffi::c_void,
        count: usize,
        size: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_aligned_recalloc(
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
        alignment: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_aligned_offset_recalloc(
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
        alignment: usize,
        offset: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_wcsdup(s: *const ::core::ffi::c_ushort) -> *mut ::core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn mi_mbsdup(s: *const ::core::ffi::c_uchar) -> *mut ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn mi_dupenv_s(
        buf: *mut *mut ::core::ffi::c_char,
        size: *mut usize,
        name: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_wdupenv_s(
        buf: *mut *mut ::core::ffi::c_ushort,
        size: *mut usize,
        name: *const ::core::ffi::c_ushort,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn mi_free_size(p: *mut ::core::ffi::c_void, size: usize);
}
unsafe extern "C" {
    pub fn mi_free_size_aligned(p: *mut ::core::ffi::c_void, size: usize, alignment: usize);
}
unsafe extern "C" {
    pub fn mi_free_aligned(p: *mut ::core::ffi::c_void, alignment: usize);
}
unsafe extern "C" {
    pub fn mi_new(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_new_aligned(size: usize, alignment: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_new_nothrow(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_new_aligned_nothrow(size: usize, alignment: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_new_n(count: usize, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_new_realloc(p: *mut ::core::ffi::c_void, newsize: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_new_reallocn(
        p: *mut ::core::ffi::c_void,
        newcount: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_alloc_new(heap: *mut mi_heap_t, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn mi_heap_alloc_new_n(
        heap: *mut mi_heap_t,
        count: usize,
        size: usize,
    ) -> *mut ::core::ffi::c_void;
}
